// Измененный код процедуры для перехода в свой модуль

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
// 	Отказ - Булево -
// 	СтандартнаяОбработка - Булево - 
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ЛокализацияМодификацийФормОбъектовСервер.ПриСозданииНаСервереИзменениеФорм(Форма, Отказ, СтандартнаяОбработка);	

КонецПроцедуры
