// Измененный код процедуры для перехода в свой модуль

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
// 	Отказ - Булево - признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ЛокализацияМодификацийФормОбъектов.ПриСозданииНаСервереИзменениеФорм(Форма, Отказ, СтандартнаяОбработка);	

КонецПроцедуры
