
#Область ПрограммныйИнтерфейс

Процедура ПриСозданииНаСервереФормаДокумента(Форма, Отказ, СтандартнаяОбработка) Экспорт 	
	
	Если Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ПриСозданииНаСервере_РеализацияТоваровУслуг_ФормаДокумента(Форма, Отказ, СтандартнаяОбработка);
				
	ИначеЕсли Форма.ИмяФормы = "Документ.ВнутреннееПотребление.Форма.ФормаДокумента" Тогда 
		ПриСозданииНаСервере_ВнутреннееПотреблениеТоваров_ФормаДокумента(Форма, Отказ, СтандартнаяОбработка);

	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииНаСервереФормаЭлемента(Форма, Отказ, СтандартнаяОбработка) Экспорт

	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда 
		ПриСозданииНаСервере_Номенклатура_ФормаЭлемента(Форма, Отказ, СтандартнаяОбработка); 
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда  
		ПриСозданииНаСервере_Контрагенты_ФормаЭлемента(Форма, Отказ, СтандартнаяОбработка);

	КонецЕсли;
		
КонецПроцедуры

Процедура ПриСозданииНаСервереФормаВыбора(Форма, Отказ, СтандартнаяОбработка) Экспорт 
	
	МодификацияФормВыбораОбщая(Форма, Отказ, СтандартнаяОбработка);
	
	Если Форма.ИмяФормы = "Справочник.Подразделения.Форма.ФормаВыбораУправляемая" Тогда
		ПриСозданииНаСервере_Подразделения_ФормаВыбора(Форма, Отказ, СтандартнаяОбработка);	
	
	ИначеЕсли Форма.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаВыбора" Тогда
		ПриСозданииНаСервере_ДоговорыКонтрагентов_ФормаВыбора(Форма, Отказ, СтандартнаяОбработка);	
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииНаСервереПроизвольныеФормы(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	МодификацияПроизвольныхФормОбщая(Форма, Отказ, СтандартнаяОбработка);
	
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.РазблокированиеРеквизитов" Тогда 
		ПриСозданииНаСервере_Номенклатура_РазблокированиеРеквизитов(Форма, Отказ, СтандартнаяОбработка);
		
	ИначеЕсли Форма.ИмяФормы = "Обработка.КлиентБанк.Форма.ВыгрузкаВБанк" Тогда
		ПриСозданииНаСервере_КлиентБанк_ВыгрузкаВБанк(Форма, Отказ, СтандартнаяОбработка);
		
	ИначеЕсли Форма.ИмяФормы = "Обработка.КлиентБанк.Форма.ЗагрузкаВыписки" Тогда
		ПриСозданииНаСервере_КлиентБанк_ЗагрузкаВыписки(Форма, Отказ, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПриСозданииНаСервере_ФормаДокумента
#КонецОбласти

#Область ПриСозданииНаСервере_ФормаЭлемента
#КонецОбласти

#Область ПриСозданииНаСервере_ФормаВыбора
#КонецОбласти

#Область ПриСозданииНаСервере_ПроизвольныеФормы
#КонецОбласти